<template>
  <div class="about">
    <section class="resumes">
      <div>
        <h1 class="title">自傳</h1>
        <p class="title_center">
          你好，我是一位轉職求職者，非電腦軟體專科畢業。因為世界的趨勢下，某天我接觸了程式語言，對此我充滿興趣與好奇心，促使我開始學習前端技術也培養了我第二專長。
          <br />
          這是我的個人履歷，使用Vue3框架撰寫，利用Router去操作分頁，CSS部分使用SCSS去撰寫，並且專案透過媒體查詢
          @media 製作
          RWD響應式網頁設計，漢堡選單使用Vue的動畫過渡組件Template撰寫，盡可能展現我對前端的理解與應用能力。
          <br />
          期望藉由這份作品，可以更了解我學習成果與實作能力
        </p>
        <h3>轉職動機：</h3>
        <p>
          在新冠疫情期間，在日本工作的我不得面臨到工作裁員的危機，
          回到台灣後我培養第二專長，我進入了半導體產業。進而了解到台灣在全球半導體領域的領先地位。同時，我開始關注AI的發展，意識到這個世界正走向人工智慧時代，許多事物都仰賴程式驅動。
          <br />
          起初，我對程式語言一無所知，但心中不斷思考：AI
          是如何運作的？機器人如何做出判斷？了解以後，我發現這些技術的核心正是程式語言。我回想起高中時期接觸過
          Java，老師曾經教我們撰寫簡單邏輯來控制機器狗運作，這讓我意識到程式語言原來一直離不開人類的生活。
          <br />
          因為這樣，讓我產生了強烈的學習動機，並開始學習前端開發，也思考著未來如何將這些技術應用到日常生活中，未來希望能夠轉職成為一名前端工程師，深入探索更多技術來提升自我能力，也期望能透過語言程式未為生活帶來更好的體驗。
        </p>
        <h3>程式語言學習經歷：</h3>
        <p>
          自學程式語言的過程充滿挑戰，尤其在撰寫與邏輯思考方面，我透過小型的實作練習，來強化自己的理解能力，例如:
          Vue框架撰寫個人履歷、API串接練習、下滾式網頁、CSS製作個人名片、vue
          Router切換、RWD練習等等。憑藉過去學習日語的經驗，我將相同的方法應用在程式學習上。
          <br />
          我擅長利用網路資源查詢不懂的內容，觀察他人的解決方式，並將學過的語法與函式記錄在筆記中，一開始需要頻繁查看，但隨著練習次數增加，許多語法逐漸地記在腦海中。程式碼一步步建構起來，將複雜的資訊轉化為直觀的介面。
          <br />
          自學過程不僅鍛鍊了我的程式能力，也培養了高度的抗壓性與自主學習能力。
        </p>
        <h3>工作經驗：</h3>
        <p>
          大學畢業後，曾在日本的飯店與林間學校工作。林間學校的客群以學校機構與團體客人為主，射箭、划船、野炊等等，小型團體活動的工作讓我學到團隊合作與分工的重要性。而飯店方面，在日本和歌山縣的川久飯店擔任餐廳服務人員，主要負責接待住客與帶位。在日本工作環境中，我學會站在客人立場思考，快速理解客人的需求並即時提供解決方案是很重要的。
          <br />

          2021年，入職鍵祥資訊工程，駐點於日商東京威力公司，負責半導體設備的放樣業務。由於這是我首次接觸半導體產業，剛開始面臨不少挑戰，例如專業術語、工具認知等問題。透過長期的學習，我熟悉了無塵室平面圖、機台施工圖，並能根據工程師需求去進行任務。
        </p>
        <h3>大學經驗：</h3>
        <p>
          在大學時期，我曾擔任日籍教授的課堂助理，負責課堂資料整理、作業批改，以及課前資料準備。這工作讓我學會如何安排工作的優先順序，能讓整體有效率地完成任務。此外，由於需要與教授以日語溝通，常常會遇到聽不懂的語句或文法。我時我會透過網路資源查詢不理解的內容，並記錄下來以加深印象，這也提升了我的語言學習能力。
        </p>
        <h3>我的興趣：</h3>
        <p>
          我熱愛日本動畫，對動畫中的角色配音（聲優）特別感興趣。當初學習日語的動機是因為喜歡聲優，卻無法理解他們的部落格文章或直播內容，因此開始自學。
          當時經濟條件有限，我主要依靠網路上的教學影片學習，並投入大量時間反覆觀看與練習，長時間下來已經能閱讀聲優的部落格文章，也能聽懂他們的直播內容，這讓我體會到努力的回報是值得的。
        </p>
        <div class="footer"></div>
      </div>
    </section>
  </div>
</template>

<style lang="scss" scoped>
* {
  font-family: Georgia, "Times New Roman", Times, serif;
}
.title_center {
  border: 1px solid #6493e9;
  border-radius: 25px;
  padding: 25px;
}
.resumes {
  @media (max-width: 1024px) {
    width: 768px;
    margin: 0 auto;
  }
  @media (max-width: 768px) {
    margin: 0 auto;
  }
  .title {
    font-size: 35px;
    letter-spacing: 10px;
    padding-bottom: 35px;
    display: flex;
    justify-content: center;
    align-items: center;
  }
  h3 {
    font-size: 25px;
    letter-spacing: 3px;
    margin: 25px 0 18px;
    @media (max-width: 768px) {
      margin: 0 auto;
      font-size: 30px;
      margin-bottom: 20px;
    }
  }
  h3 ~ h3 {
    border-top: 1px solid #000;
    @media (max-width: 768px) {
      margin-top: 25px;
    }
  }
  p {
    font-size: 18px;
    letter-spacing: 1px;
    line-height: 2;
    @media (max-width: 768px) {
      margin: 0 auto;
      font-size: 23px;
    }
  }
  .footer {
    margin-bottom: 100px;
  }
}
</style>
